#პირველი დავალება --- 
#მომხმარებელმა უნდა შემოიტანოს რიცხვი 1 - დან 1000 - მდე,
#თქვენი მიზანია, რომ გამოიცნოთ შემოტანილი რიცხვი,
#თუ სწორი იქნება დაპრინტეთ 'სწორია!', ხოლო თუ არასწორია,
#დაპრინტეთ ;არასწორია!

num = int(input("შეიყვანე რიცხვი 1 დან 1000მდე:"))

print(num)

guss_number = 500

is_equal = num == guss_number

print("შენი საბოლო პასუხი არის სწორი:",guss_number,"ეს არის",is_equal)



#მეორე დავალება ---

#დაწერეთ პროგრამა, რომელიც მოუწოდებს მომხმარებელს შეიყვანოს ნივთების რაოდენობა, რომლის შეძენაც სურს.
#დარწმუნდით, რომ მომხმარებელი შეიყვანს დადებითი რიცხვს.
#თითოეული ნივთისთვის, შესთავაზეთ მომხმარებელს შეიყვანოს ფასი.
#დარწმუნდით, რომ მომხმარებელი შეიყვანოს დადებითი რიცხვს პროდუქტის ფასისთვის.
#გამოთვალეთ და აჩვენეთ ყველა ელემენტის მთლიანი ღირებულება.


item = int(input("Enter items that you like:"))

price = int(input("Enter items price:"))

print(item * price)


#მესამე დავალება --- 



#დაწერეთ პროგრამა, რომელიც მოუწოდებს მომხმარებელს შეიყვანოს წონა (კილოგრამებში) და სიმაღლე (მეტრებში).
#გამოთვალეთ სხეულის მასის ინდექსი (BMI) ფორმულის გამოყენებით: BMI = წონა / (სიმაღლე * სიმაღლე).
#გამოთვლილი BMI-დან გამომდინარე, მიაწოდეთ მომხმარებლის ჯანმრთელობის შეტყობინება:
#თუ BMI 18.5-ზე ნაკლებია, აჩვენეთ "Underweight". თუ BMI არის 18.5-დან 24.9-მდე,
#ჩვენება "ნორმალური წონა". თუ BMI არის 25-დან 29.9-მდე, აჩვენეთ "Overweight".
#თუ BMI არის 30 ან მეტი, აჩვენეთ "სიმსუქნე". 
#აჩვენეთ გამოთვლილი BMI და ჯანმრთელობის შეტყობინება გამოყენებისთვის

weight = int(input("Enter your Kg:"))
height = int(input("Enter your cm:"))

BMI = weight / (height * height)

print(int(BMI))

#?

#2) შედარებითი ოპერატორები

#გააკეთეთ 10 მაგალითი შედარებით ოპერატორებზე.

# or
print(5 > 6 or 9 > 6)
print(5 < 6 or 9 < 6)
print(9 > 6 or 6 == 6)
print(5 > 6 or 2 > 6)
print(7 > 6 or 8 > 3)

# and
print(4 > 7 and 9 < 6)
print(9 < 6 and 10 < 6)
print(8 == 8 and 6 == 6)
print(5 < 6 and 2 < 6)
print(1 > 6 and 9 > 3)

#3) ლოგიკური ოპერატორები


#პირველი დავალება ---
#დაწერეთ პროგრამა,  რათა შეამოწმოთ, აქვს თუ არა მომხმარებელს ფასდაკლების უფლება მისი ასაკისა და შესყიდვის მთლიანი თანხის მიხედვით.
#შესთავაზეთ მომხმარებელს შეიყვანოს მათი ასაკი და შესყიდვის მთლიანი თანხა. დარწმუნდით,
#რომ მომხმარებელი შეიყვანს დადებითი რიცხვს ასაკისა და შესყიდვის თანხისთვის.
#გამოიყენეთ შემდეგი ფასდაკლების წესები: 60 წელზე უფროსი ასაკის მომხმარებლებს შეუძლიათ ისარგებლონ ფასდაკლებით.
#კლიენტებს, რომლებიც ხარჯავენ $100 ან მეტს, შეუძლიათ მიიღონ ფასდაკლება.
#60 წელზე უფროსი ასაკის მომხმარებლები და 100 დოლარი ან მეტი დახარჯული აქვთ უფრო მაღალი ფასდაკლების უფლება.
#მომხმარებლისთვის აჩვენეთ შეტყობინება, რომელშიც მითითებულია, შეუძლიათ თუ არა მას ფასდაკლება და ფასდაკლების ოდენობა,
#თუ ეს შესაძლებელია.


#?


#მეორე დავალება ---

#დაწერეთ პროგრამა, რათა შეამოწმოთ, არის თუ არა სტუდენტი უფლებამოსილი 
#სტიპენდიის მისაღებად მათი აკადემიური მოსწრებისა და ოჯახის შემოსავლის მიხედვით.
#სთხოვეთ მომხმარებელს შეიყვანოს თავისი GPA (საშუალო ქულა) და ოჯახის შემოსავალი. დარწმუნდით,
#რომ მომხმარებელი შეიყვანს დადებითრიცხვებს. გამოიყენეთ შემდეგი დასაშვებობის კრიტერიუმები: სტუდენტები GPA 3.
#5 ან მეტი ადამიანი უფლებამოსილია სტიპენდიის მისაღებად.
#სტუდენტები, რომლებსაც აქვთ GPA 3.0 ან მეტი და ოჯახის შემოსავალი $50,000-ზე ნაკლები, შეუძლიათ მიიღონ უმაღლესი სტიპენდია.
#სტუდენტები, რომლებსაც აქვთ GPA 3.0-ზე დაბალი, არ შეუძლიათ სტიპენდიის მიღება. 
#მომხმარებლისთვის აჩვენეთ შეტყობინება, რომელშიც მითითებულია, რამდენად შეუძლიათ სტიპენდიის მიღება და სტიპენდიის ოდენობა,
#თუ ეს შესაძლებელია.
